<template lang="pug">
    .character-finder
        input(type="text" v-model="inputText")
        .text(v-for="r of result" :key="r.text") 
            .text {{r.text}}
            .tips(v-if="!r.position.length") 查無資料
            .tips(v-for="pos of r.position")
                span.text-prefix {{pos.prefix}}
                span {{pos.visiableText}}
</template>

<script>

const chars = [
`ああああ亞啞娃阿哀愛相間
挨姶會逢青蒼碧葵朱赤垢紅
証曉曉茜龝秋晃晶惡握曙顎
渥淺淺朝麻旭葦足腳芦鰺梓
東汗邊仇值價頭壓斡扱宛後
跡穴兄姉姐虻油尼網雨飴絢
綾鮎彩嵐新或粟泡袷安庵按
暗案闇鞍餡殷杏`,
`いいいいいい以伊位依偉囲
夷委威尉惟意慰易椅為畏異
移維緯胃萎衣謂違遺醫井亥
戌韋羿家彥庵雷碇息域幾育
郁池憩功勲勳石礎泉磯礒一
壱壹弌溢逸稻鰯茨芋允印咽
員因姻引飲淫胤蔭院陰隱韻
殷吋`,
`うううう右宇烏羽迂雨卯上
魚兔牛丑氏潮後鵜窺碓臼渦
噓歌唄唱詩宴內家器欝蔚腕
鰻項姥厩初馬海梅裏浦瓜漆
鱗閏噂云運雲`,
`ええええええ荏繪得江會餌
叡營嬰影映曳榮永泳洩瑛盈
穎穎英衛詠銳液疫益驛枝悅
謁越閱榎蝦夷襟衿厭円苫園
堰奄宴延怨掩援沿演炎焰煙
燕猿緣艷苑薗遠鉛鴛鹽`,
`おおおお於汙甥凹央往應押
旺橫歐毆王扇皇櫻翁襖鶯鷗
黃凰狼丘岡沖荻奧億屋憶臆
桶長鴛雄牡乙夫弟男鬼斧己
帶主面表親折俺卸御恩溫穩
音女`,
`かかか下化仮何伽價佳加可
嘉夏嫁家寡科暇果架歌河火
珂禍禾稼箇花苛茄荷華菓蝦
課嘩貨迦過霞蚊日暇俄峨我
牙畫臥芽蛾賀雅餓駕介會解
回塊壞迴快怪悔恢懷戒拐改
廣藪舩魁晦械海灰界皆繪芥
蟹開階貝蚕凱劾外咳害崖慨
概涯礙蓋街該鎧骸浬馨楓蛙
香鏡垣柿礪鍵鈎劃嚇各廓拡
攪格核殼獲確穫覺角赫較郭
閣隔革學岳樂樂額顎筧陰影
蔭崖掛笠棧傘樫橿梶鰍貸頭
柏數霞風肩方片型敵形貌潟
刀塊且克勝割喝恰括活渴滑
葛褐劼轄鰹桂糧叶椛樺門鼎
要金鐘庚鞄株兜竈蒲甲壁釜
鎌噛鴨栢茅萱窯紙神髮雷瓶
鷗粥空唐柄烏体仮狩刈苅彼
川皮革側蛙瓦乾侃冠寒刊勘
勸卷喚堪姦完官寬干幹患感
慣憾換敢柑桓棺款歡汗漢澗
灌環甘監看竿管簡緩缶翰肝
艦莞觀諫貫還鑑間閑關陷韓
館館丸含岸巖玩癌眼岩翫贋
雁頑顏願`,
`きき企伎危喜器基奇嬉寄岐
希木黃樹幾忌揮機旗既期棋
棄磯機歸毅氣汽畿祈季稀紀
徽規記貴起軌輝飢騎鬼龜毀
嵜几暉偽儀妓宜戲技擬欺犧
疑祇義蟻誼議魏掬菊鞠后岸
傷絆北吉吉狐吃喫桔橘詰砧
杵黍卻客腳虐逆丘久仇清休
及吸宮弓急救朽求汲泣灸球
究窮笈級糾給旧牛去居巨拒
拠拳渠虛許距遽鋸漁禦魚亨
享京供俠僑兇競共凶協匡卿
叫喬境峽強彊怯恐恭挾教橋
槁況狂狹矯胸脅興蕎鄉鏡響
姜饗驚仰凝堯曉業餃局曲極
玉桐粁僅勤均巾布際錦斤欣
欽琴禁禽筋緊芹菌衿襟謹近
金吟銀`,
`くく久九俱句區狗玖矩苦軀
驅駈駒具愚虞喰空偶寓遇隅
杭莖釘草鎖串櫛釧藥屑癖曲
口唇屈掘窟沓靴轡国國那窪
熊隈組粂雲倉藏藏瞑栗繰吳
吳紅黑鐵桑桒鍬勲君薰訓勲
勳群軍郡`,
`けけけ毛卦袈祁係傾刑兄啟
圭珪型契形徑惠慶慧憩揭攜
敬景桂溪畦稽系經繼繫罫莖
荊螢計詣警輕頸雞奎芸迎鯨
劇戟擊激隙桁傑欠決潔穴結
血訣月煙獸件儉倦健兼券劍
喧圈堅嫌建憲懸拳捲檢權牽
犬獻研硯絹縣肩見謙賢軒遣
鍵險顯驗鹼腱元原嚴幻弦減
源玄現絃舷鉉言諺限`,
`ここ乎個古呼固姑孤己庫弧
戶苔子仔故枯湖狐糊袴股胡
菰虎誇跨鈷雇顧鼓五互伍午
吳吾娛後御悟梧檎瑚碁語誤
護醐鯉戀乞聲肥交佼倖光洸
公功効勾厚口向后喉坑垢好
孔孝宏工巧巷幸廣庚康弘恒
慌抗拘控攻昂晃更杭校梗構
江洪浩港溝甲皇硬稿糠紅紘
絞綱耕考肯肱腔膏航荒行衡
講貢購郊酵鑛礦鋼閤降項香
高高鴻候侯晧皓姜滉吼竑剛
劫號合壕拷濠豪轟氷麴克刻
告国國穀酷鵠黑獄心志漉腰
輿梢答甑忽惚骨狛込事言琴
異壽此諺粉拳米曆頃毀今困
坤墾婚恨懇昏昆根梱混痕紺
艮魂渾`,
`ささ些佐又唆嵯左差查沙瑳
砂詐鎖裟磋坐座挫債催再最
哉塞妻宰彩才採栽歲濟災采
犀碎砦祭齋齋細菜裁載際崔
劑在材罪財早幸冴竿坂阪逆
性界堺境榊肴咲杯盃魚先崎
崎埼碕嵜岬鷺魁作削咋搾昨
朔柵窄策索錯炸櫻櫻酒鮭笹
匙冊刷察拶撮擦札殺薩雜皐
鯖捌里悟智聰暫殘澤澤條錆
寂樣侍鮫鞘皿更晒三傘參山
慘撒散棧燦珊產算纂蚕讚贊
贊酸餐斬`,
`しし仕仔伺使刺司史嗣四士
始姉姿子屍市師志思指支孜
斯施旨枝止死氏獅祉私糸紙
紫肢脂至視視詞詩試誌諮資
熾賜雌飼齒摯疵事似侍兒兒
寺慈持時次滋治爾璽痔磁示
而耳自蒔辭幸椎爺鹽潮汐鹿
梓式識鴫竺軸茂繁宍猪靜閑
雫滴下舌七叱執失嫉室悉濕
漆疾質實實蔀品科篠忍偲柴
芝屡蕊島嶋嶌霜縞舍寫射捨
赦斜煮社紗者謝車遮蛇邪借
勺尺杓灼爵酌釋鯱錫若寂弱
惹主取守手姑朱殊狩珠種腫
趣酒首壽十柔尻汁儒受呪壽
授樹綬需囚收周宗就州修脩
愁拾洲秀秋終繡習臭舟蒐眾
襲讐蹴輯週酋酬集醜壽什住
充從戎柔涉獸縱重銃叔夙宿
淑祝縮肅塾熟出術述俊峻春
瞬竣舜巡駿准循旬楯殉詢淳
準潤盾純遵醇順處初所暑曙
渚渚庶緒署書薯藷諸助敘女
序徐恕鋤除傷償勝匠升召哨
商唱嘗獎獎妾娼宵將小少尚
生庄床廠彰承抄招掌捷昇翔
昌昭晶松梢樟樵沼消涉湘燒
焦照症省硝礁祥祥穪章笑粧
紹肖菖蔣蕉衝裳訟頌証詔詳
象賞醬鉦鍾鐘障鞘蕭上丈丞
乘冗剩城場壤孃常情擾条杖
淨狀疊穰蒸讓釀錠條囑埴飾
拭植殖燭織職色觸食蝕辱白
代銀伸信侵唇娠寢尻印徵標
心慎振新普森榛浸深申疹真
神秦紳臣芯薪審親診身真辛
進針震晨人仁刃塵壬尋甚尽
腎訊迅陣靭笥殿椹`,
`すす諏州巢須醮圖廚逗吹垂
帥推水炊睡粹翠慧衰遂醉錐
錘隨隨瑞髓崇嵩數樞趨雛据
末姿隙鋤杉椙直助介輔祐祐
菅頗筋煤鈴薄雀獎獎昂條硯
裾簾京渾澄摺墨炭角李寸`,
`せせ世背脊瀨畝是凄制勢勢
姓征性成政整星晴棲栖正清
牲生盛精聖聲製西誠誓請晟
逝醒青靜齊齊稅脆隻席惜戚
斥昔析石積籍績咳堰關責赤
跡蹟碩切拙接攝攝折設竊節
說雪絕舌錢蟬芹競仙先千占
宣專尖川戰扇撰栓栴泉淺淺
洗染潛煎煽旋穿箭線纖羨腺
舛船薦詮賤踐踐選遷錢銑閃
鮮塹前善漸然全禪繕膳糎`,
`そそ噌塑岨措曾曾楚狙疏疏
礎祖租粗素組蘇訴阻遡鼠僧
創雙叢倉喪壯奏爽宋層匝惣
想搜掃插搔操早曹巢槍槽漕
燥爭瘦相窸糟總綜聰草莊葬
蒼藻裝走送遭颯鎗霜騷像增
憎臟藏贈造翔候促側則即息
捉束測足速俗屬賊族續底卒
袖外苑其園薗梵傍空天虛某
揃存孫尊損村遜`,
`たた田他多太汰詑唾墮妥惰
打柁舵楕陀駄驒体堆對耐岱
帶待怠態戴替泰滯胎腿苔袋
貸退逮隊黛鯛代台大第醍題
橙平高高鷹貴隆寶滝瀧薪卓
啄宅托擇拓澤濯琢託鐸濁諾
巧匠工竹丈岳茸武猛健毅凧
蛸只唯叩但疊質館達橘忽辰
竜奪脫巽豎縱盾楯立辿店棚
掌谷狸種胤束度旅玉珠彈靈
魂賜民為溜鱈樽誰俵丹單嘆
坦担探旦歎淡湛炭短端簞綻
耽胆貪蛋誕眈鍛團壇彈斷暖
檀段男談`,
`ちち千血值知地弛乳恥智池
痴稚置致蜘遲馳茅力契築畜
竹筑蓄逐父秩窒巷茶嗟嫡著
中仲宙忠抽昼柱注虫衷註酎
鑄駐樗瀦猪苧著貯丁兆凋喋
寵帖帳廳弔張彫徵懲挑暢朝
潮牒町眺聽脹腸蝶笘趙調諜
超跳銚長頂鳥勅捗直朕塵沈
珍賃鎮陳椹`,
`つつつつ津墜椎朔序槌追鎚
痛通杖束柄塚栂司官宰摑月
槻次機佃漬柘辻蔦綴鍔土槌
壤戊筒統堤鼓葛伝綱紘維恒
常角唾椿翼燕粒潰瞑坪壺嬬
紬局妻罪爪艷露面弦吊釣鶴
靍劍`,
`てて手掌亭低停偵剃貞呈堤
定帝底庭廷弟悌抵挺提梯汀
碇禎程締艇訂諦蹄遞邸鄭釘
鼎泥摘擢敵滴的笛適鏑溺哲
徹撤轍迭鐵寺照輝典填天展
店添纏甜貼轉顛點傳殿澱田
電`,
`とと十戶兔吐堵塗妬屠徒斗
杜渡登菟賭途都鍍砥礪努度
土奴問樋怒倒黨冬凍刀唐塔
塘套宕島嶋悼投搭東桃檮棟
盜淘湯濤灯燈當痘禱等答筒
糖統到董蕩藤討謄豆踏逃透
通鐙陶頭騰鬥橙働動同堂導
憧撞洞瞳童胴萄道銅時峠徹
鴇伽匿得德瀆特督禿篤毒獨
讀刺床常所處年歲敏稔栃橡
凸突椴屆轟隣殿帳鳶罪苫富
富友共伴供朋智巴豐虎寅酉
鳥雞虜砦弗瀞噸屯惇敦沌豚
遁頓吞眈曇鈍丼貪`,
`なな名菜奈那內尚猶直中仲
乍凪薙汀渚渚情無梨謎灘捺
七何鍋生鉛並波浪淚楢馴也
成鳴繩畷南楠軟難汝爾`,
`にに二丹荷尼弍邇匂賑肉西
虹錦廿偽贋日乳入如尿韮庭
雞任妊忍認`,
`ぬぬ濡沼糠主布`,
`ねね子音根禰禰寧葱猫熱年
念粘捻撚燃`,
`のの乃逎野之埜囊惱濃納能
腦膿農軒禾鋸覗後喉咽蚤糊
則函紀憲呪`,
`はは巴刃葉齒端場把播霸杷
波派琶破婆罵芭馬薔俳廢摔
排敗杯盃牌背灰肺輩配倍培
媒梅楳煤狽買賣賠陪這蠅秤
矧萩伯剝博拍柏泊白箔粕舶
薄迫曝漠爆縛莫駁麥函箱硲
箸肇始初一柱筈斜蓮櫨幡旗
肌膚畑畠裸八鉢蜂潑發醱髮
伐罰抜筏閥茉鳩花華鼻話噺
塙羽羽母幅浜濱濱蛤林隼原
腹針梁遙遙伴判半反叛帆搬
斑板氾汎版犯班畔繁般藩販
範采煩頒飯絆挽晚番盤磐蕃
蠻曼饅`,
`ひひ匪卑日火否妃庇彼悲扉
批披斐比泌疲皮碑秘緋罷肥
被誹燈費避非飛樋簸備尾微
枇毘琵眉美鼻柊稗東光匹疋
髭彥彥膝菱肘肱聖歪弼額左
必畢筆逼棺羊人雛檜檜丙暇
閑姬媛紐百謬俵彪標氷漂瓢
票表評豹廟描病秒苗錨鋲玹
平炳蒜蛭鰭尋廣弘廣品彬斌
浜瀕貧賓頻敏瓶`,
`ふふ不付埠夫婦富富布府怖
扶敷斧普浮父符腐膚芙譜負
賦赴阜附侮撫武舞葡蕪部封
楓風笛葺蕗伏副復幅服福腹
複覆袋節藤襖淵渕弗払沸仏
物鮒舟船舩麓冬分吻噴墳憤
扮焚奮粉糞紛雰文聞`,
`へへ丙部併兵塀幣平弊柄炳
並蔽閉秉陛米頁僻壁癖璧碧
別瞥蔑箆紅蛇偏變片篇編邊
反遍邊邊便勉娩弁鞭屁`,
`ほほ保帆舖鋪圃捕步甫補輔
穗募墓慕戊暮母簿菩倣俸包
呆報奉寶峰峯崩庖抱捧放方
朋法泡烹砲縫胞芳萌蓬蜂褒
訪豐邦鋒飽鳳鵬幫彗乏亡傍
剖坊妨帽忘忙房暴望某棒冒
紡肪膨謀貌貿鉾防吠頰他外
北僕卜墨撲朴牧睦穆釦勃矛
星螢沒程殆骨炎譽杋洞堀濠
幌奔本翻凡盆們梵`,
`まま摩磨魔麻埋妹昧枚每哩
真真前牧薪槙槙幕膜枕鮪柾
鱒桝枡亦俁又股町街松抹末
沫茉祭迄的窸円愛眼疎幻儘
繭鞠丸希稀麿萬慢滿漫蔓曼
萬槙`,
`みみ味未三實魅已箕帝幹右
巫命尊操岬水瑞湖店溝晦道
路滿密蜜貢綠翠湊蓑簑皆港
稔南源峰實耳耳宮京都脈幸
妙瞑粍民眠珉`,
`むむ務夢無牟矛霧鵡昔麥椋
骸婿虫娘鞭六旨胸棟村邑群
紫室`,
`めめ目芽眼冥名命明盟迷銘
鳴姪瞑妾飯雌牝滅免棉綿緬
面麵`,
`もも喪摸模茂妄孟毛猛盲網
耗蒙儲木默目杢勿餅持尤元
本基素許戻物者籾椛揉百股
桃貰森守杜唐問悶紋門匆們`,
`やややや也八矢谷哉屋家冶
夜爺耶野彌灸刃館館輩族厄
役約藥譯躍奕櫓邸社安靖康
奴宿柳藪山病`,
`ゆゆゆゆ愉愈湯油癒諭輸唯
佑優勇友宥幽悠憂揖有柚湧
涌猶猷由祐裕誘遊邑郵雄融
夕結侑故床雪柚豐指弓夢`,
`よよよよ予余與世代四譽輿
預夜豫與宵傭幼妖容庸揚搖
擁曜楊樣洋溶熔鎔用窯羊耀
燿葉蓉要謠踊遙遙陽養燁慾
抑欲沃浴翌翼邪由吉吉葦淀
鎧萬甦`,
`らら羅等螺裸薇來來賴雷磊
洛絡落酪亂卵嵐欄濫藍蘭覽`,
`りり利吏履李梨理璃痢裏裡
里離莉陸律率立葎廖掠略劉
流溜琉留硫粒隆竜龍侶慮旅
虜了亮僚両凌寮料梁涼獵療
瞭稜糧良諒遼量陵領力綠倫
厘林淋燐琳臨輪隣鱗麟凜`,
`るる瑠流壘淚累類`,
`れれ令伶禮冷勵嶺怜玲例苓
鈴隸零靈麗齡黎莉磊曆歷列
劣烈裂廉戀憐漣煉簾練聯蓮
連鍊`,
`ろろ呂魯櫓爐賂路露勞婁廊
弄朗朗樓榔浪漏牢狼籠老聾
蠟郎六麓祿肋錄論`,
`わわわわ倭和話輪環歪賄猥
吾我若脇惑椊譯技業厄禍鷲
亙棉綿腸私亘罠鰐詫藁蕨童
割椀灣碗腕`
]

export default {
    name: 'CharacterFinder',
    data(){
        return {
            inputText: ''
        }
    },
    computed: {
        uni(){
            return Array.from(new Set(this.inputText.split('')))
        },
        result(){
            return this.uni.map(c => {
                    return {
                        text: c,
                        position: this.findChar(c)
                    }
                })
        }
    },
    methods: {
        findChar(target){
            const result = chars.filter(c => c.includes(target))
                .map(c => {
                    const ROW_NUMBER = 5
                    const COL_NUMBER = 12 + 1 // 每行顯示12字，外加1個\n
                    const prefix =  c[0]
                    const index = 1 + c.indexOf(target)
                    const page = Math.floor(index / (ROW_NUMBER * COL_NUMBER))
                    const row = 1 + Math.floor(index / COL_NUMBER) 
                    const col = index % COL_NUMBER
                    const visiableText = `第 ${page + 1} 頁，第 ${row - (page * 5)} 行第 ${col} 字`
                    return {
                        target,
                        prefix,
                        visiableText
                    }
                })
            return result
        }
    }
}
</script>

<style lang="scss" scoped>
.text-prefix {
    display: inline-block;
    width: 1.5em;
    height: 1.5em;
    line-height: 1.5em;
    text-align: center;
    background-color: #2c3e50;
    color: #fff;
    border-radius: 4px;
}

.tips{
    margin-bottom: 4px;
}
</style>